---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.FlexDuct
source: html/38738bec-ada3-2fa7-b016-1b2aec8d25ce.htm
---
# FlexDuct Properties

The id of the assembly instance to which the element belongs.